app/views/stories/index.html.erb

SELECT COUNT(*) FROM "bdds" WHERE "bdds"."story_id" = 1
---
    <td><%= story.confirmation %></td>
    <td><%= story.bdds.count %></td>