app/views/stories/show.html.erb


  <% @story.bdds.each do |bdd| %>
---
SELECT "bdds".* FROM "bdds" WHERE "bdds"."story_id" = 1