app/controllers/bdds_controller.rb

  def index
    @bdds = Bdd.all
---
SELECT "bdds".* FROM "bdds"

  def show
    @bdd = Bdd.find(params[:id])
---
SELECT "bdds".* FROM "bdds" WHERE "bdds"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @bdd = Bdd.new(params[:bdd])

    respond_to do |format|
      if @bdd.save
---
INSERT INTO "bdds" ("created_at", "give", "story_id", "then", "updated_at", "when") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Oct 2012 16:39:40 UTC +00:00], ["give", "test"], ["story_id", "1"], ["then", "test"], ["updated_at", Tue, 16 Oct 2012 16:39:40 UTC +00:00], ["when", "test"]]