app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT "stories".* FROM "stories"

  def show
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("action", "confirmation", "created_at", "role", "updated_at") VALUES (?, ?, ?, ?, ?)  [["action", "test"], ["confirmation", "test"], ["created_at", Tue, 16 Oct 2012 16:39:07 UTC +00:00], ["role", "test"], ["updated_at", Tue, 16 Oct 2012 16:39:07 UTC +00:00]]

  def update
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "2"]]

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 3]]